<a href="https://colab.research.google.com/github/GENNYB7/GroupBy/blob/main/GroupBy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [28]:
import pandas as pd
filename = 'https://raw.githubusercontent.com/mGalarnyk/Tutorial_Data/master/Pandas/CalIt2.data'
df = pd.read_csv(filename, header=None)
print(df)

       0         1         2  3
0      7  07/24/05  00:00:00  0
1      9  07/24/05  00:00:00  0
2      7  07/24/05  00:30:00  1
3      9  07/24/05  00:30:00  0
4      7  07/24/05  01:00:00  0
...   ..       ...       ... ..
10075  9  11/05/05  22:30:00  0
10076  7  11/05/05  23:00:00  0
10077  9  11/05/05  23:00:00  0
10078  7  11/05/05  23:30:00  1
10079  9  11/05/05  23:30:00  0

[10080 rows x 4 columns]

In [32]:
df = df.rename(columns={'1': 'Flow_ID'})
df.head()

   0         1         2  3
0  7  07/24/05  00:00:00  0
1  9  07/24/05  00:00:00  0
2  7  07/24/05  00:30:00  1
3  9  07/24/05  00:30:00  0
4  7  07/24/05  01:00:00  0

In [33]:
df.info

<bound method DataFrame.info of        0         1         2  3
0      7  07/24/05  00:00:00  0
1      9  07/24/05  00:00:00  0
2      7  07/24/05  00:30:00  1
3      9  07/24/05  00:30:00  0
4      7  07/24/05  01:00:00  0
...   ..       ...       ... ..
10075  9  11/05/05  22:30:00  0
10076  7  11/05/05  23:00:00  0
10077  9  11/05/05  23:00:00  0
10078  7  11/05/05  23:30:00  1
10079  9  11/05/05  23:30:00  0

[10080 rows x 4 columns]>

In [34]:
df.columns = ['Flow_ID',
              'Date',
              'Time',
              'Count']
df.head()

   Flow_ID      Date      Time  Count
0        7  07/24/05  00:00:00      0
1        9  07/24/05  00:00:00      0
2        7  07/24/05  00:30:00      1
3        9  07/24/05  00:30:00      0
4        7  07/24/05  01:00:00      0

In [71]:
date_filter = df['Date']== '07/24/05'
df[date_filter]

       Flow_ID      Date      Time  Count
0            7  07/24/05  00:00:00      0
1            7  07/24/05  00:00:00      0
2            7  07/24/05  00:30:00      1
3            7  07/24/05  00:30:00      0
4            7  07/24/05  01:00:00      0
...        ...       ...       ...    ...
10075        7  07/24/05  22:30:00      0
10076        7  07/24/05  23:00:00      0
10077        7  07/24/05  23:00:00      0
10078        7  07/24/05  23:30:00      1
10079        7  07/24/05  23:30:00      0

[10080 rows x 4 columns]

In [72]:
flowId_filter = df['Flow_ID']< 9
df[flowId_filter]

       Flow_ID      Date      Time  Count
0            7  07/24/05  00:00:00      0
1            7  07/24/05  00:00:00      0
2            7  07/24/05  00:30:00      1
3            7  07/24/05  00:30:00      0
4            7  07/24/05  01:00:00      0
...        ...       ...       ...    ...
10075        7  07/24/05  22:30:00      0
10076        7  07/24/05  23:00:00      0
10077        7  07/24/05  23:00:00      0
10078        7  07/24/05  23:30:00      1
10079        7  07/24/05  23:30:00      0

[10080 rows x 4 columns]

In [69]:
df[date_filter & flowId_filter].head()

   Flow_ID      Date      Time  Count
0        7  07/24/05  00:00:00      0
1        7  07/24/05  00:00:00      0
2        7  07/24/05  00:30:00      1
3        7  07/24/05  00:30:00      0
4        7  07/24/05  01:00:00      0

In [70]:
df[date_filter & flowId_filter]
df

       Flow_ID      Date      Time  Count
0            7  07/24/05  00:00:00      0
1            7  07/24/05  00:00:00      0
2            7  07/24/05  00:30:00      1
3            7  07/24/05  00:30:00      0
4            7  07/24/05  01:00:00      0
...        ...       ...       ...    ...
10075        7  07/24/05  22:30:00      0
10076        7  07/24/05  23:00:00      0
10077        7  07/24/05  23:00:00      0
10078        7  07/24/05  23:30:00      1
10079        7  07/24/05  23:30:00      0

[10080 rows x 4 columns]

In [74]:
df = df.sort_values('Count', ascending=False)
df.head(10)

      Flow_ID      Date      Time  Count
6879        7  07/24/05  15:30:00     62
335         7  07/24/05  11:30:00     61
6881        7  07/24/05  16:00:00     55
9682        7  07/24/05  20:30:00     54
9686        7  07/24/05  21:30:00     54
9681        7  07/24/05  20:00:00     53
6878        7  07/24/05  15:30:00     52
9933        7  07/24/05  11:00:00     50
3615        7  07/24/05  15:30:00     50
8913        7  07/24/05  20:00:00     50